export default {
  namespace: 'chart',

  state: {
    PieData1: [
      {
        x: '已复诊',
        y: 4544,
      },
      {
        x: '住院',
        y: 3321,
      },
      {
        x: '转院',
        y: 3113,
      },
      {
        x: '已分娩',
        y: 2341,
      },
      {
        x: '妊娠终止',
        y: 1231,
      },
      {
        x: '失访',
        y: 1231,
      },
      {
        x: '未有结果',
        y: 1231,
      },
    ],
    PieData2: [
      {
        x: '按时',
        y: 1231,
      },
      {
        x: '超时1~6天',
        y: 1000,
      },
      {
        x: '超时7~12天',
        y: 20,
      },
      {
        x: '超时13天以上',
        y: 16,
      },
    ],
  },

  effects: {},

  reduces: {},
};
